---
kind: property
id: P:Autodesk.Revit.DB.PDFExportOptions.ColorDepth
source: html/a27be705-d2a1-fe02-3d25-f42e37ac9d3e.htm
---
# Autodesk.Revit.DB.PDFExportOptions.ColorDepth Property

Color depth of either black/white, gray scale or color.

## Syntax (C#)
```csharp
public ColorDepthType ColorDepth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration